In [1]:
import pandas as pd

In [2]:
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

In [4]:
employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [3]:
employee_uni

   id  unique_id
0   3          1
1  11          2
2  90          3

In [12]:
df = employees.merge(employee_uni, on = "id", how = "left" ).fillna("null")
df

   id      name unique_id
0   1     Alice      null
1   7       Bob      null
2  11      Meir       2.0
3  90   Winston       3.0
4   3  Jonathan       1.0